; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v2 - type_2 ?v1 - type_3)
 	      (pred_2 ?v8 - object ?v1 - type_3)
	      (pred_1 ?v2 - type_2 ?v6 - type_1)
	      (pred_3 ?v2 - type_2 ?v8 - object ?v6 - type_1))

   (:action op_3
       :parameters  (?v2 - type_2 ?v4 ?v5 - type_3)
       :precondition (and  (pred_4 ?v2 ?v4))
       :effect (and  (pred_4 ?v2 ?v5)
		     (not (pred_4 ?v2 ?v4))))

   (:action op_1
       :parameters (?v2 - type_2 ?v7 - object ?v3 - type_3 ?v6 - type_1)
       :precondition  (and  (pred_2 ?v7 ?v3) (pred_4 ?v2 ?v3) (pred_1 ?v2 ?v6))
       :effect (and (pred_3 ?v2 ?v7 ?v6)
		    (not (pred_2 ?v7 ?v3)) 
		    (not (pred_1 ?v2 ?v6))))

   (:action op_2
       :parameters (?v2 - type_2 ?v7 - object ?v3 - type_3 ?v6 - type_1)
       :precondition  (and  (pred_3 ?v2 ?v7 ?v6) (pred_4 ?v2 ?v3))
       :effect (and (pred_2 ?v7 ?v3)
		    (pred_1 ?v2 ?v6)
		    (not (pred_3 ?v2 ?v7 ?v6)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_06 obj_03 - type_2
obj_07 obj_08 obj_10 obj_02 - type_1
obj_11 obj_12 obj_04 obj_05 - type_3
obj_09 obj_01 obj_13 - object)
(:init
(pred_4 obj_06 obj_05)
(pred_1 obj_06 obj_07)
(pred_1 obj_06 obj_08)
(pred_4 obj_03 obj_11)
(pred_1 obj_03 obj_10)
(pred_1 obj_03 obj_02)
(pred_2 obj_09 obj_11)
(pred_2 obj_01 obj_04)
(pred_2 obj_13 obj_12)
)
(:goal
(and
(pred_2 obj_09 obj_11)
(pred_2 obj_01 obj_11)
(pred_2 obj_13 obj_05)
)
)

(:constraints
  (always (not (pred_4 obj_06 obj_04)))
)
)

; plan
1. (op_3 obj_06 obj_05 obj_12)
   deleted: (pred_4 obj_06 obj_05)
   added: (pred_4 obj_06 obj_12)
   goals met: 1 of 3
2. (op_3 obj_03 obj_11 obj_04)
   deleted: (pred_4 obj_03 obj_11)
   added: (pred_4 obj_03 obj_04)
   goals met: 1 of 3
3. (op_1 obj_03 obj_01 obj_04 obj_02)
   deleted: (pred_2 obj_01 obj_04) (pred_1 obj_03 obj_02)
   added: (pred_3 obj_03 obj_01 obj_02)
   goals met: 1 of 3
4. (op_1 obj_06 obj_13 obj_12 obj_08)
   deleted: (pred_2 obj_13 obj_12) (pred_1 obj_06 obj_08)
   added: (pred_3 obj_06 obj_13 obj_08)
   goals met: 1 of 3
5. (op_3 obj_03 obj_04 obj_11)
   deleted: (pred_4 obj_03 obj_04)
   added: (pred_4 obj_03 obj_11)
   goals met: 1 of 3
6. (op_3 obj_06 obj_12 obj_05)
   deleted: (pred_4 obj_06 obj_12)
   added: (pred_4 obj_06 obj_05)
   goals met: 1 of 3
7. (op_2 obj_06 obj_13 obj_05 obj_08)
   deleted: (pred_3 obj_06 obj_13 obj_08)
   added: (pred_2 obj_13 obj_05) (pred_1 obj_06 obj_08)
   goals met: 2 of 3
8. (op_2 obj_03 obj_01 obj_11 obj_02)
   deleted: (pred_3 obj_03 obj_01 obj_02)
   added: (pred_2 obj_01 obj_11) (pred_1 obj_03 obj_02)
   goals met: 3 of 3
